Revit 2026 API

# FolderItemInfo Properties

---

The FolderItemInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementId | **Obsolete.** The folder parameter Id |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The folder name |

#### Reference

FolderItemInfo Class

Autodesk.Revit.DB Namespace